{"Date": "May. 13, 2025", "Time": "8:15 pm", "Tag": "Staking", "Author": "Gino Matos", "Free": "False", "Title": "Virtuals debuts veVIRTUAL staking to boost rewards for Genesis launchpad users", "Content": "Virtuals has introduced a new staking mechanism for its native token VIRTUAL , replacing passive holding incentives with a vote-escrowed structure that grants users veVIRTUAL. According to a May 13 post on X , veVIRTUAL holders will receive 20% of all Virgen Point emissions, which were previously distributed based on token holding. This move establishes veVIRTUAL as the primary mechanism for reward allocation, airdrop eligibility, and future on-chain governance participation within the Virtuals protocol. In addition to Virgen Points and governance eligibility, veVIRTUAL holders are now eligible for “Genesis Airdrops.” Genesis is Virtuals’ launchpad for new tokens. It offers a 24-hour presale period during which users can trade Virgen Points and VIRTUAL to earn a share of 37.5% of the token supply, capped at 0.5%. As a result, veVIRTUAL holders would be eligible to receive a share of the tokens launched on Genesis. However, the announcement did not disclose further details on the airdrop conditions. Virtuals is priced at $2.07 and has been leading the performance of the AI agents-related tokens with over $100 million in market cap, soaring 270% in the past 30 days as of May 13, according to CoinGecko data . When users stake VIRTUAL, the vote-escrowed token veVIRTUAL is issued. The quantity of tokens staked and the lockup duration, which can extend to two years, determine the amount of veVIRTUAL received. The protocol has implemented linear decay for veVIRTUAL balances, which decrease over time until the stake unlocks. To maximize the conversion rate, users can select an “Auto Max-Lock” option that locks tokens for the full duration and yields a 1:1 ratio of veVIRTUAL per VIRTUAL. Virtuals stated that veVIRTUAL will also serve as the basis for governance rights after introducing on-chain voting mechanisms. This effectively transitions VIRTUAL from a passive utility asset to an active instrument of governance and rewards. According to the announcement, users who stake their VIRTUAL tokens within 24 hours of the May 13 post will qualify for a separate, unspecified reward that will be revealed the following day. While specifics are pending, the call-to-action marks the start of a broader campaign to drive long-term staking participation. The staking mechanism mirrors the vote-escrow systems first popularized by protocols such as Curve Finance , where governance influence and reward allocations are proportionate to token lockups rather than raw balances. The model’s design aims to reward long-term alignment and reduce speculative token velocity. Virtuals framed the rollout as a departure from passive participation toward a structure prioritizing extended token commitment. ", "URL": "https://cryptoslate.com/virtuals-debuts-vevirtual-staking-to-boost-rewards-for-genesis-launchpad-users/"}